MyProject/src/Documents/ЗаказКлиент/ЗаказКлиент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиент</name>
  <attributes>
    <name>КомментарийКЗаказу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаказа</name>
    <attributes>
      <name>СтатьяЗаказа</name>
      <type>
        <types>CatalogRef.Меню</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоПоПозицииМеню</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyProject/src/Documents/ЗаказКлиент/Forms/Заказ/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

Объект.Итого = 0;
Для каждого СтрокаДокумента Из Объект.СоставЗаказа Цикл
Объект.Итого = Объект.Итого + (СтрокаДокумента.Количество * СтрокаДокумента.Цена);
КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СоставЗаказаНаименованиеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставЗаказа.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.СтатьяЗаказа) Тогда
		ТекущиеДанные.Цена = ТекущиеДанные.СтатьяЗаказа.ЦенаТовара;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	СтрокаТабличнойЧасти.ИтогоПоПозицииМеню = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
КонецПроцедуры
